InformationRegisters/ОсновныеБанковскиеСчетаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеБанковскиеСчетаКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/БанковскиеСчетаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчетаКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьБанки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьБанкДляРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьБанки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОсновныеБанковскиеСчетаКонтрагентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Контрагент", "РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьОсновнойБанковскийСчет(Ссылка, ОсновнойСчет) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Ссылка.Владелец);
	НаборЗаписей.Прочитать();
	
	// Текущий счет указан основным.
	Если ОсновнойСчет Тогда
		// есть счет, помеченный как основной
		Если НаборЗаписей.Количество() = 1 Тогда
			
			Если НаборЗаписей[0].БанковскийСчетКонтрагента = Ссылка Тогда
				Возврат;
			Иначе
				НаборЗаписей[0].БанковскийСчетКонтрагента = Ссылка;
			КонецЕсли;
			
		Иначе
			// нет основного счета
			НаборЗаписей.Добавить();
			НаборЗаписей[0].Контрагент = Ссылка.Владелец; 
			НаборЗаписей[0].БанковскийСчетКонтрагента = Ссылка;	
			
		КонецЕсли;	
	// Текущий счет не указан основным.
	Иначе
		// есть счет, помеченный как основной
		Если НаборЗаписей.Количество() = 1 Тогда 
			// не очищаем другой счет, помеченный как основной
			Если НаборЗаписей[0].БанковскийСчетКонтрагента <> Ссылка Тогда
				Возврат;
			Иначе				
				НаборЗаписей.Очистить();
			КонецЕсли;
			
		КонецЕсли;  
	КонецЕсли;	
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

// Формирует временную таблицу, содержащую поля Контрагент, БанковскийСчетКонтрагента, Банк, НомерСчета.
// Банковский счет отбирается по принципам:
//	- Если есть банковский счет указанный как основной - то будет возвращен этот.
//	- Если нет счета, который указан как основной - то один из списка счетов.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц.
//	СписокКонтрагентов		- Массив ссылок на элементы справочников СправочникСсылка.Контрагенты, СправочникСсылка.ФизическиеЛица.
//	Банк					- СправочникСсылка.КлассификаторБанков - банк счета контрагента, если требуется отбор.
//
Процедура СоздатьВТОсновныеБанковскиеСчетаКонтрагентов(МенеджерВременныхТаблиц, СписокКонтрагентов, Банк = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("БанкЗадан", ЗначениеЗаполнено(Банк));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновныеБанковскиеСчетаКонтрагентов.Контрагент КАК Контрагент,
		|	ОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента
		|ПОМЕСТИТЬ ВТБанковскиеСчетаКонтрагентов
		|ИЗ
		|	РегистрСведений.ОсновныеБанковскиеСчетаКонтрагентов КАК ОсновныеБанковскиеСчетаКонтрагентов
		|ГДЕ
		|	ОсновныеБанковскиеСчетаКонтрагентов.Контрагент В(&СписокКонтрагентов)
		|	И ОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка)
		|	И (ОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента.Банк = &Банк
		|			ИЛИ НЕ &БанкЗадан)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТБанковскиеСчетаКонтрагентов.Контрагент КАК Контрагент,
		|	ВТБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента
		|ПОМЕСТИТЬ ВТОсновныеБанковскиеСчета
		|ИЗ
		|	ВТБанковскиеСчетаКонтрагентов КАК ВТБанковскиеСчетаКонтрагентов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БанковскиеСчетаКонтрагентов.Владелец,
		|	МАКСИМУМ(БанковскиеСчетаКонтрагентов.Ссылка)
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБанковскиеСчетаКонтрагентов КАК ВТБанковскиеСчетаКонтрагентов
		|		ПО БанковскиеСчетаКонтрагентов.Владелец = ВТБанковскиеСчетаКонтрагентов.Контрагент
		|ГДЕ
		|	НЕ БанковскиеСчетаКонтрагентов.ПометкаУдаления
		|	И БанковскиеСчетаКонтрагентов.Владелец В(&СписокКонтрагентов)
		|	И ВТБанковскиеСчетаКонтрагентов.Контрагент ЕСТЬ NULL
		|	И (БанковскиеСчетаКонтрагентов.Банк = &Банк
		|			ИЛИ НЕ &БанкЗадан)
		|
		|СГРУППИРОВАТЬ ПО
		|	БанковскиеСчетаКонтрагентов.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОсновныеБанковскиеСчетаКонтрагентов.Контрагент КАК Контрагент,
		|	ВТОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
		|	ВТОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента.Банк КАК Банк,
		|	ВТОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета
		|ПОМЕСТИТЬ ВТОсновныеБанковскиеСчетаКонтрагентов
		|ИЗ
		|	ВТОсновныеБанковскиеСчета КАК ВТОсновныеБанковскиеСчетаКонтрагентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТБанковскиеСчетаКонтрагентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОсновныеБанковскиеСчета";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Возвращает основной банковский счет контрагента.
//
// Параметры:
//	Контрагент - СправочникСсылка.Контрагенты, СправочникСсылка.ФизическиеЛица - владелец счета.
//
// Возвращаемое значение:
//	ОсновнойБанковскийСчетКонтрагента - СправочникСсылка.БанковскиеСчетаКонтрагентов - основной банковский счет.
//
Функция ОсновнойБанковскийСчетКонтрагента(Контрагент) Экспорт
	
	ОсновнойБанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента
		|ИЗ
		|	РегистрСведений.ОсновныеБанковскиеСчетаКонтрагентов КАК ОсновныеБанковскиеСчетаКонтрагентов
		|ГДЕ
		|	ОсновныеБанковскиеСчетаКонтрагентов.Контрагент = &Контрагент";

	Результат = Запрос.Выполнить(); 
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ОсновнойБанковскийСчетКонтрагента = Выборка.БанковскийСчетКонтрагента; 
		КонецЕсли;
	КонецЕсли;
		
	Возврат ОсновнойБанковскийСчетКонтрагента;

КонецФункции

#КонецОбласти

#КонецЕсли
